backend: !!python/unicode 'tensorflow'
class_name: Sequential
config:
- class_name: MyLayer
  config:
    batch_input_shape: !!python/tuple [null, 28, 28]
    dtype: float32
    name: my_layer_4
    trainable: true
- class_name: Lambda
  config:
    arguments: {}
    function: !!python/tuple [!!python/unicode "c\x01\0\0\0\x01\0\0\0\x02\0\0\0C\0\
        \0\0s\b\0\0\0|\0\0d\x01\0\x13S(\x02\0\0\0Ni\x02\0\0\0(\0\0\0\0(\x01\0\0\0\
        t\x01\0\0\0x(\0\0\0\0(\0\0\0\0s\x1F\0\0\0<ipython-input-39-7286cc5cc04b>t\b\
        \0\0\0<lambda>\x05\0\0\0s\0\0\0\0", null, null]
    function_type: lambda
    name: lambda_2
    output_shape: null
    output_shape_type: raw
    trainable: true
keras_version: 2.0.5
